{
  "services": {
    "Haircut": [
      {
        "id": 1,
        "serviceName": "Women’s (short)",
        "description": "A stylish, customized cut designed for your individual fresh and trendy goals",
        "price": "$55+"
      },
      {
        "id": 2,
        "serviceName": "Men's Haircut",
        "description": "A clean, precise haircut tailored for men's styles.",
        "price": "$35+"
      },
      {
        "id": 3,
        "serviceName": "Kid's Haircut",
        "description": "A fun, comfortable haircut for children",
        "price": "$30+"
      },
      {
        "id": 4,
        "serviceName": "Bang Trim",
        "description": "A quick trim to keep your bangs in shape and looking sharp",
        "price": "$20+"
      }
    ],
    "Color": [
      {
        "id": 5,
        "serviceName": "Root Retouch",
        "description": "Refresh your natural color with a precise root touch-up",
        "price": "$100+"
      },
      {
        "id": 6,
        "serviceName": "Full Color",
        "description": "Achieve vibrant, all-over color for a fresh, polished look",
        "price": "$150+"
      },
      {
        "id": 7,
        "serviceName": "Toner",
        "description": "Enhance or correct your color with a custom toner application",
        "price": "$100+"
      }
    ],
    "Styling": [
      {
        "id": 8,
        "serviceName": "Wash & Style (Short)",
        "description": "A refreshing wash followed by a sleek style for short hair",
        "price": "$35+"
      },
      {
        "id": 9,
        "serviceName": "Wash and Style (Long)",
        "description": "A luxurious wash and professional styling for long, flowing locks",
        "price": "$50+"
      },
      {
        "id": 10,
        "serviceName": "Formal Updo (Glam)",
        "description": "Elegant, sophisticated updo for special occasions or parties",
        "price": "$80+"
      }
    ],
    "Blonding Service": [
      {
        "id": 11,
        "serviceName": "Partial Highlights",
        "description": "Add dimension with highlights focused on the top sections of your hair",
        "price": "$150+"
      },
      {
        "id": 12,
        "serviceName": "Full Head Highlights",
        "description": "Brighten your entire look with highlights from root to tip",
        "price": "$180+"
      },
      {
        "id": 13,
        "serviceName": "Balayage Highlights",
        "description": "Achieve a sun-kissed, natural-looking blend of highlights with a hand-painted technique",
        "price": "$250+"
      },
      {
        "id": 14,
        "serviceName": "Ombre Balayage",
        "description": "Get a seamless transition from dark to light with this dramatic, customized color technique",
        "price": "$350+"
      },
      {
        "id": 15,
        "serviceName": "Global Bleach",
        "description": "Lighten your hair all over with a professional bleaching service",
        "price": "$400+"
      },
      {
        "id": 16,
        "serviceName": "Color Correction",
        "description": "Correct uneven or unwanted color for a flawless, balanced result",
        "price": "$300+"
      },
      {
        "id": 17,
        "serviceName": "Bleach Touchup",
        "description": "Maintain your bleached hair with a touch-up for consistent brightness",
        "price": "$180+"
      }
    ],
    "Hair Treatments": [
      {
        "id": 18,
        "serviceName": "Kerasilk Smoothing Treatments",
        "description": "Achieve silky, frizz-free hair with a long-lasting smoothing treatment",
        "price": "$300+"
      },
      {
        "id": 19,
        "serviceName": "De-Frizz Treatment",
        "description": "Smooth and control frizz for a sleek, polished look",
        "price": "$150+"
      },
      {
        "id": 20,
        "serviceName": "Deep Conditioning Treatment",
        "description": "Restore moisture and shine with a nourishing deep conditioning session",
        "price": "$45+"
      },
      {
        "id": 21,
        "serviceName": "Hair Mask",
        "description": "A nourishing hair mask treatment designed to deeply hydrate and repair dry, damaged, or over-processed hair",
        "price": "$25+"
      },
      {
        "id": 22,
        "serviceName": "Olaplex Treatment",
        "description": "A treatment that reconnects broken disulfide bonds in the hair restoring its natural integrity.",
        "price": "$45+"
      }
    ]
  },
  "reviews": {
    "review_1": {
      "reviewer": "Charm",
      "content": "My first visit was actually just for a haircut. When Donna was finished with my hair it was exactly what I want. Donna is really awesome! She has many years of experience and very trustworthy. I highly recommend her! I'd like to thank Donwin as well. He's really nice and I love the scalp massage. He's such a pro! lol I forgot the name of her daughter who did the haircut to my husband. She really did a great job on his hair too. I can say that the price is right! because we're so happy with the service and experience. The place is very welcoming and comfortable too. Thanks again to Donna and her team!! ❤"
    },
    "review_2": {
      "reviewer": "Marienette Mallari",
      "content": "Very professional. They did exactly the style I asked. They will give you a good head massage while shampooing your hair. You get what you paid for. Excellent service. Will definitely come back. Thanks to Donna."
    },
    "review_3": {
      "reviewer": "Daniel",
      "content": "Great value and experience overall. I booked my appointment with Donwin and I showed up at the appointed time. He personally let me in and proceeded with the usual COVID screening measures and took my temp. Masks were provincially mandatory when I went. Donwin began with cleaning and conditioning my hair and then discussed my preferences with the look I was going for. I showed him a picture of my desired look, and he took my ad hoc suggestions in stride. He was professional, verbal about his actions, and personable with conversation. He didn't usually work on beards but I asked him to clean it up for me and he did with no issues or fuss. Donna was great with consultative suggestions with various aspects of the beard as well. Donwin made it happen with no problems. Pictures attached from 3 times I went, 2 pics per time. Thanks, Donwin!"
    },
    "review_4": {
      "reviewer": "Karen Purugganan",
      "content": "Love their service, staff and products. I got a balayage done by Dana alongside Donna and Donwin. It turned out amazing and they were all so professional, informative and nice. Being somebody who isn't experienced or used to maintaining hair, Dana took the time to answer my questions, explain certain things and recommend some products for my new hair! If you're looking for a new stylist or salon, this is the place to go. Definitely worth your time and money! Already looking forward to my next visit."
    },
    "review_5": {
      "reviewer": "Kyle Miller",
      "content": "This place is super awesome place looks nice really well done and the employees are like SUPER friendly and nice hair cuts are amazing as well 😀 😊  and its actually not 2 expensive either love this place.........I wouldn't normally rate a hair salon or barber but this place is really great just AWESOME"
    },
    "review_6": {
      "reviewer": "Dixie Bughaw",
      "content": "I really loved my experience at Donna D' Salon! Not only did I come out with a beautiful cut and style from Dana, but the atmosphere and the people were amazing. They were able to accommodate me last minute and gave me the cut that I envisioned to have. I will definitely come back and bring my mom next time!"
    },
    "review_7": {
      "reviewer": "Joelle Roulette",
      "content": "Went here a few times and got my hair done. Absolutely best service I got ever! My stylist was Tashina. She was very friendly and took nice care of my hair. I would really recommend her!!"
    },
    "review_8": {
      "reviewer": "Jann Ledda",
      "content": "Just got my haircut by Dana, and I couldn’t be happier! She truly listened to what I wanted and gave me exactly the look I envisioned. Her attention to detail and skill are incredible, and she made the whole experience so relaxing and enjoyable. I highly recommend Dana to anyone looking for a fantastic stylist! For Men and Women."
    },
    "review_9": {
      "reviewer": "Kathy Cruz",
      "content": "I have been going to Donna’s Hairstylist for years. She’s been the only hairstylist that I trust because she knows how to work with someone that has thick, frizzy hair. She also takes her time, she’s not rushing. And what I love the most is the service."
    }
  },
  "staffs": [
    {
      "name": "Donna",
      "role": "Owner & Master Colorist",
      "description": "Donna is a proud mother of four and the owner of Donna D’ Stylist Salon. She is a licensed stylist with over 17 years of experience and is also known for being a Master Colorist. Donna has been in many different positions in the hair industry. She started as a regular stylist and moved her way to a Government Hair Examiner, an Aveda Educator, and finally to Salon Owner. Through the years, Donna has earned her name as a Master Colorist. As a Master Colorist, she is an expert in creating gorgeous shades of brown, blonde, and silver. She can handle the toughest color corrections and can properly bring your hair to the colour of your dreams. Her signature haircuts are precise and are specially designed for every client. Donna has traveled abroad to several hair shows and classes to always keep updated with the latest trends. Hair is her passion. She believes that being a hairdresser gives her the ability to help people feel better about themselves and transform their lives for the better.",
      "certificates": [
        "Certificate of Completion – Scientific Marvel 2008 Certificate",
        "Master Colorist Certificate- Wella",
        "Masterclass Certificate – Sassoon Academy Sta. Monica, California",
        "Makeup Artistry Certificate – Noir Studio",
        "Lash Extension Certificate – Noir Studio"
      ],
      "trainings": [
        "Behind The Chair Show -2019 Washington DC",
        "Color Class – Goldwell 2018",
        "Educator Training – 2016 Toronto",
        "Paul Michell 'The Gathering' Color/Cut/Style with Paul Mitchell Team- 2012 Las Vegas, Nevada",
        "Color Class Matrix Color – 2012 San Francisco California",
        "Paul Mitchell 'The Gathering' Color /Cut/Style With Paul Mitchell Team – 2011 Las Vegas Nevada",
        "Cutting Class with Celebrity Stylist Michael O’ Rourke, Los Angeles California"
      ],
      "awards": [
        "ICCAP Award 2016 -AVEDA Institute Winnipeg",
        "ICCAP Award 2015- AVEDA Institute Winnipeg",
        "ICCAP Award 2014 – AVEDA Institute Winnipeg",
        "Hair Fantasy Competition – Gold, Scientific Marvel",
        "Avant-Garde Women’s Cut & Color, Competition – Gold, Scientific Marvel",
        "Men’s Cut & Colour Competition -Silver, Scientific Marvel"
      ]
    },
    {
      "name": "Dana",
      "role": "Senior Stylist",
      "description": "Dana is a Senior stylist with over 4 years of experience in the hair industry. She has a strong interest in Asian-inspired hair hairstyles and is looking at creative ways to deliver modern looks. Dana likes being able to customize the look of her clients to suit their lifestyle and personality. In 2019, Dana attended the BTC Show to expand her knowledge in hair. From that show, she was inspired by influencer stylists to continue to work on her craft and improve as a hairdresser. Dana is an excellent listener and is ready to make her next guest’s haircut their best!",
      "certificates": [
        "Certificate of Completion from the Scientific Marvel in 2017",
        "Certified Hairdresser since 2018",
        "Barbicide Disinfection and Sanitation Certificate"
      ]
    },
    {
      "name": "Donwin",
      "role": "Junior Stylist",
      "description": "Donwin is a Junior Stylist who graduated from the Aveda Institute in May. He’s an eager hairstylist whose number one priority is making sure that you leave the salon feeling better than when you came in. Donwin is a well-rounded hairstylist and is studying barbering. He’s working hard and aspires to become Donna D’ Stylists best barber. He specializes in head massages and washes so he’s sure to leave you feeling relaxed and refreshed. Donwin’s head massages are based on Ayurvedic Head Massage techniques. He’s learned some of these techniques from Aveda and is continually working on improving this skill. He believes that the head wash at the sink is the most personable experience someone can ever have in the salon.",
      "certificates": [
        "Certificate of Completion from the Aveda Institute Winnipeg in 2020",
        "Barbicide Disinfection and Sanitation Certificate"
      ]
    },
    {
      "name": "Tashina",
      "role": "Junior Stylist",
      "description": "Tashina Roulette is a Junior Stylist who graduated from the R.B. Russell Vocational Pre-industry Hairstyling Program in June 2021. She was at the top of her class earning several in-class and industry awards. Tashina specializes in braiding and is keen on improving her craft. She is creative, determined, dependable and hardworking. Tashina is eager to learn all about hair coloring and the variety of techniques involved."
    },
    {
      "name": "Shae-D",
      "role": "Apprentice Stylist",
      "description": "Shae-D graduated top of her class from RB Russell Pre-industry Hairstyling Program, she is an apprentice stylist working towards her red seal certificate to become a full-time hairstylist. Shae-D specializes in color services especially when it comes to blondes as well as braiding hair. She loves doing creative designs. Changing someone's appearance and seeing them happy is a rewarding feeling."
    }
  ]
}
